// Завдання 1. За допомогою методу prompt() отримайте спочатку ім'я користувача,
// потім рік народження і збережіть у 2 змінні. Обчисліть вік користувача та виведіть
// його в абзаці за допомогою alert() у такому форматі "Антон: 24".
// Визначте залишок від розподілу кількості років на 10. Залежно від цього виведіть в абзаці
// "Антон: 21 рік" або "Антон: 24 роки" або "Антон: 25 років".
// Тобто. всім чисел з першого в кінці має бути "_1 рік", для чисел з 2,3,4
// наприкінці - "_3 роки", а всіх інших - "_7 років".
// Ви можете використовувати для цього умовні конструкції if...else або switch...case.

// const name = prompt("Enter your name:");
// const birth = prompt("Enter year of your birth:");

// const age = 2022 - birth;

// let message;

// switch (age % 10) {
//   case 1:
//     message = "рік";
//     break;

//   case 2:
//   case 3:
//   case 4:
//     message = "роки";
//     break;

//   default:
//     message = "років";
// }

// alert(`${name}: ${age} ${message}`);
