// Завдання 3. За допомогою prompt() пропонуєте користувачеві ввести число від 1 до 10 включно та
// записуєте змінну. Другий змінної привласнюєте випадкове число в тому ж діапазоні за
// допомогою Math.random(), закругливши його до цілого значення.
// У випадку, якщо випадкове число та число, введене користувачем збіглися, виводьте в
// консоль "Ви щасливчик! Ваше число ...",
// якщо не збіглися - "Не вгадали! Ваше число ..., а випало число ..." (замість точок мають бути значення відповідних змінних.

// let num;

// do {
//   num = Number(prompt("Enter number from 1 to 10:"));
// } while (num < 1 || num > 10);

// let randomNum = Math.random() * 10 + 1;

// randomNum = Math.floor(randomNum);
// console.log(randomNum);

// if (num === randomNum) {
//   alert(`Ви щасливчик! Ваше число ${randomNum}`);
// } else {
//   alert(`Не вгадали! Ваше число ${num}, а випало число ${randomNum}`);
// }
